public class SingleDecision {
     //เริ่มต้นสร้าง Class ที่ชื่อเหมือนกับไฟล์//
    public static void main(String[] args) {
        // สร้างเมธอด main เพื่อทำงานโค้ดที่อยู่ใน main//
        int number = 15;
         //ประกาศตัวแปรชื่อ number เป็น int กำหนัดเป็น 15//
        if (number > 0 ) 
        //เป็นคำสั่งที่ตรวจสอบว่าค่าของ number มากกว่า 0 หรือไม่//
        {
            //คำสั่งจะทำงานถ้าเงื่อนไขใน if เป็นจริง โดยจะแสดงว่า "จำนวนเต็มบวก"//
            System.out.println("จำนวนเต็มบวก");
            //เป็นคำสั่งที่จะทำงานเมื่อเงื่อนไขของ if เป็นจริง//
        }
        System.out.println("จบโปรแกรม");
        //คำสั่งนี้จะทำงานทุกกรณี โดยแสดงผลทางหน้าจอว่า "จบโปรแกรม"//
    }
    //สิ้นสุดการทำงานของ main//
}
//สิ้นสุดคลาส SingleDecision//
